app/Controllers/Home.php

SELECT *
FROM `satta`
---
    public function index()
    {
        $sattamodel = new SattaModel();
        $data['list'] = $sattamodel->findAll();

SELECT *
FROM `admin`
WHERE `email` = 'oldghantabazar@gmail.com'
 LIMIT 1
---
    public function adminLogin() {

        if (strtolower($this->request->getMethod()) !== 'post') {
            // get request
            return view('adminlogin', [
                'validation' => null]);
        }

        $rules = [
            'email' => 'required',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return view('adminlogin', [
                'validation' => $this->validator,
            ]);
        }

        $request = \Config\Services::request();
        $session = \Config\Services::session();

        $userModel = new AdminModel();
        $email = $this->request->getVar('email');
        $pass =  $this->request->getVar('password');
        $user = $userModel->where( 'email', $email)->first();

SELECT *
FROM `satta`
---
    public function admin() {
        // showing list of satta with option to edit and delete

        $satamodel = new SattaModel();
        $data = $satamodel->findall();

SELECT *
FROM `satta`
WHERE `satta`.`id` = '9'
---
    public function adminSattaEdit($id = null) {

        $satamodel = new SattaModel();
        $sataPanelModel = new SattaPanelModel();
        $row = $satamodel->find($id);

SELECT *
FROM `satta`
WHERE `satta`.`id` = '3'
---
    public function adminSattaDeleteConfirmation($id =null) {

        $session = \Config\Services::session();

        $satamodel = new SattaModel();
        $row = $satamodel->find($id);

SELECT *
FROM `satta_panel`
WHERE `satta_id` = '1'
ORDER BY `created_at` ASC
---
    public function sattaPanel($id = null) {
        // echo $id;

        if($id != null) {

            $sataPanelModel = new SattaPanelModel();
            $sataRowModel = new SattaModel();
            $sataRow = $sataRowModel->find($id);

            $rowsPanel = $sataPanelModel->where('satta_id', $id)->orderBy('created_at', 'asc')->findAll();

SELECT *
FROM `satta_panel`
WHERE `satta_id` = '1'
ORDER BY `created_at` ASC
---
    public function sattaJodi($id = null) {
        if($id != null) {

            $sataPanelModel = new SattaPanelModel();

            $sataRowModel = new SattaModel();
            $sataRow = $sataRowModel->find($id);




            $rowsPanel = $sataPanelModel->where('satta_id', $id)->orderBy('created_at', 'asc')->findAll();