app/Controllers/Home.php

    public function sattaJodi($id = null) {
        if($id != null) {

            $sataPanelModel = new SattaPanelModel();

            $sataRowModel = new SattaModel();
            $sataRow = $sataRowModel->find($id);

            $rowsPanel = $sataPanelModel->where('satta_id', $id)->orderBy('created_at', 'asc')->findAll();
---
SELECT *
FROM `satta`
WHERE `satta`.`id` = '1'
SELECT *
FROM `satta_panel`
WHERE `satta_id` = '1'
ORDER BY `created_at` ASC

    public function adminSettings() {
        // return view('adminsettings');

        $request = \Config\Services::request();
        $session = \Config\Services::session();
        $userEmail = $session->get('email');

        $admin = new AdminModel();
        $user = $admin->where( 'email', $userEmail)->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'oldghantabazar@gmail.com'
 LIMIT 1

        }
        else {
            $session->setFlashdata('success', 'Setting saved successfully');
            $admin->update($session->get('id'), ['two_step_auth' => 'false']);
---
UPDATE `admin` SET `two_step_auth` = 'false'
WHERE `admin`.`id` IN ('1')

    public function adminChangeEmail() {

        $email = \Config\Services::email();
        $session = \Config\Services::session();
        $request = \Config\Services::request();

        $admin = new AdminModel();
        $subject = 'Requested to Change Admin Email';
        $message = 'test message';

        $data = $admin->findall();
---
SELECT *
FROM `admin`